Sermus/ESP8266_ArduinoIDE/Espressif/ESP8266/boards.txt
# See: http://code.google.com/p/arduino/wiki/Platforms

menu.cpu=Processor

##############################################################

esp8266.name=ESP8266
esp8266.build.f_cpu=80000000L
esp8266.build.core=esp8266
esp8266.upload.tool=esptool
esp8266.upload.protocol=esptool
esp8266.build.mcu=lx106